//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let array = [2,17,13,6,22,31,45,66,100,-18]


//1. перебрати його циклом while
// let i = 0
// while (i<10){
//     console.log(array[i])
//     i++
// }


//2. перебрати його циклом for
// for (let i = 0; i<=9; i++){
//     console.log(array[i])
// }


//3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0
// while(i<=9){
//     if (array[i] % 2 === 1){
//         console.log(`Непарні числа ${array[i]}`)
//     }
//     i++
// }


//4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i<=9; i++){
//     if (array[i] % 2 === 1){
//         console.log(`Непарні чила: ${array[i]}`)
//     }
// }


//5. перебрати циклом while та вивести  числа тільки парні  значення
// let i = 0
// while (i<=9){
//     if (array[i] % 2 === 0){
//         console.log(`Парні числа: ${array[i]}`)
//     }
//     i++
// }


//6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = 0; i<=9; i++){
//     if (array[i] % 2 === 0){
//         console.log(`Парні числа: ${array[i]}`)
//     }
// }


//7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i<=9; i++){
//     if (array[i] % 3 === 0){
//         document.write(array[i]=`<h1>"okten"</h1>`)
//     }
// }


//8. вивести масив в зворотньому порядку.
// for (let i = array.length; i>-1; i--){
//     console.log(array[i])
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//1. перебрати його циклом while

// let i = array.length
// while (i>=0){
//     console.log(array[i])
//     i--
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//2. перебрати його циклом for

// for (let i = array.length -1; i>=0; i--){
//     console.log(array[i])
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let i = array.length - 1
// while (i>=0){
//     if (array[i] % 2 === 1){
//         console.log(`Непарні числа: ${array[i]}`)
//     }
//     i--
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (let i = array.length - 1; i>=0; i--){
//     if (array[i] % 2 === 1){
//         console.log(`Непарні числа: ${array[i]}`)
//     }
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//5. перебрати циклом while та вивести  числа тільки парні  значення

// let i = array.length - 1
//
// while (i>=0){
//     if (array[i] % 2 === 0){
//         console.log(`Парні числа: ${array[i]}`)
//     }
//     i--
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = array.length - 1; i>=0; i--){
//     if (array[i] % 2 === 0){
//         console.log(`Парні числа: ${array[i]}`)
//     }
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//7. замінити кожне число кратне 3 на слово "okten"

// let i = array.length - 1
//
// while (i>=0){
//     if (array[i] % 3 === 0){
//         console.log(array[i]="okten")
//     }
//     i--
// }

























